导入类(android.widget)

var _内容 = 底层(当前界面)
.置填充("16dp");

function _分隔() {
return 分隔(当前界面,"8dp");
}

var _文本1 = 文本控件(当前界面)
.置主题("默认")
.置文本("错误输出:"+文件.取存储卡缓存目录("错误日志"))
.加入到(_内容);

_分隔().加入到(_内容);

var _编辑框 = 编辑框(当前界面)
.置文本("%index.js")
.置宽度("最大")
.置高度("56dp")
.置背景(颜色.白色)
.置文本颜色(主题.文字())
.加入到(_内容);

var _按钮1 = 按钮(当前界面)
.置主题("默认")
.置文本("跳转界面")
.置单击事件(function(){

if (_编辑框.取文本() == "") 
弹窗.提示("请输入脚本地址！")
else
当前界面.跳转界面(_编辑框.取文本());

}).加入到(_内容);

_分隔().加入到(_内容);

var _滚动 = ScrollView(当前界面)
_滚动.setLayoutParams(LinearLayout.LayoutParams(-1,-1));

// UI还不完善，只能用原生的滚动

_内容.加入子元素(_滚动)

var _文本2 = 文本控件(当前界面)
.置主题("默认")
.置文本(字符.读取("@assets/help.txt"))
.加入到(_滚动);


var _标题栏 = 标题栏(当前界面,"乐园之土");

var _底层 = 底层(当前界面)
.加入子元素(_标题栏).加入子元素(_内容)
.打开(当前界面);