"use strict"; //严格模式

var 控件 = h.视图;
var 主题控件 = 控件.扩展;

let $内容 = new 主题控件.底层(当前界面)
.置填充("16dp");

var 分隔 = function() {
return new 主题控件.分隔(当前界面,"8dp");
}

let $文本 = new 控件.文本控件(当前界面)
.置主题("默认")
.置文本("输出和错误日志保存在\nAndroid/data/h.android/下")
.加入到($内容);

分隔().加入到($内容);

let $按钮1 = new 控件.按钮(当前界面)
.置主题("默认")
.置文本("新界面运行SD卡下index.js")
.置单击事件(function(参数){
当前界面.跳转("%index.js");
}).加入到($内容);


let $按钮2 = new 控件.按钮(当前界面)
.置主题("默认")
.置文本("Lua测试界面")
.置单击事件(function(参数){
当前界面.跳转("#test.lua");
}).加入到($内容);

let $标题栏 = new 主题控件.标题栏(当前界面,"乐园之土");

let $底层 = new 主题控件.底层(当前界面)
.加入子元素($标题栏).加入子元素($内容)
.打开(当前界面);

// 相当于 布局.打开(当前界面,$底层);
