// 简易 JSIDE 主页
// By MikaGuraN 2017.12.11

当前界面.不结束 = true;

// 出了错也不结束这个界面

var _底层 = 侧滑布局(当前界面)
.打开(当前界面);

var _临时文件 = "放课后乐园部/index.js";

if (!文件.是文件(_临时文件)) {
文件.复制("@assets/example.js",_临时文件);
// 初始化实例
}

var _主页 = 线性布局(当前界面)
.置主题("底层")
.置高度("最大")
.加入到(_底层);

var _标题栏 = 标题栏(当前界面)
.置标题("乐园之土")
.左按钮(function(){
_底层.打开侧滑(_侧滑);
})
.右按钮(function(){
_主页菜单.显示("左下");
})
.加入到(_主页);

var _开放源代码许可 = 弹窗.普通(当前界面,
"开放源代码许可",
字符.读取("@assets/LICENSE"),
"捐赠",function(){
网络.打开("https://QR.ALIPAY.COM/FKX06548P2GIOD2QYUKA36");
},
"项目源码",function() {
网络.打开("https://gitee.com/MikaGuraN/HL4A");
},
"我知道了",function(){
_开放源代码许可.关闭();
})

var _还原弹窗 = 弹窗.普通(当前界面
,"是否还原实例？",
"这会覆盖当前文件",
"还原",function(){
_还原弹窗.关闭();
_代码框.置文本(字符.读取("@assets/example.js"));
保存代码();
},
"取消",function(){
_还原弹窗.关闭();
}
)

var _主页菜单 = 菜单(_标题栏.右按钮对象)
.添加("还原实例",function(){
_主页菜单.关闭();
_还原弹窗.显示();
})
.添加("反馈错误",function(){
_主页菜单.关闭();
网络.QQ.作者();
})
.添加("开放源代码许可",function(){
_主页菜单.关闭();
_开放源代码许可.显示();
})

var _内容 = 线性布局(当前界面)
.置主题("底层")
.置高度("最大")
.加入到(_主页);

var _所有选中 = new 线性布局(当前界面)
.置主题("底层")
.置高度("自动")
.置方向("水平")
.置背景(主题.文字())
.隐藏()
.加入到(_内容);

var _工具栏 = 线性布局(当前界面)
.置宽度("最大")
.置高度("自动")
.置方向("垂直")
.加入到(_内容);

var _符号栏 = 横向滚动(当前界面)
.置宽度("最大")
.置高度("自动")
.加入到(_工具栏);

var _符号框 = 线性布局(当前界面)
.置主题("底层")
.置方向("水平")
.置填充("2dp",0,"2dp","2dp")
.置背景(主题.文字())
.加入到(_符号栏);

var _操作栏 = 横向滚动(当前界面)
.置宽度("最大")
.置高度("自动")
.加入到(_工具栏);

var _操作框 = 线性布局(当前界面)
.置主题("底层")
.置方向("水平")
.置填充("2dp",0,"2dp","2dp")
.置背景(主题.文字())
.加入到(_操作栏);

function 加入按钮(_内容,_方法,_加入) {
return new 线性布局(当前界面)
.置填充("6dp")
.置左填充("16dp")
.置右填充("16dp")
.置高度("36dp")
.置背景("透明")
.置重力("中间")
.加入子元素(文本控件(当前界面)
.置文本颜色(颜色.白色)
.置文本(_内容))
.置单击事件(_方法)
.加入到(_加入);
}

加入按钮("运行",function(){
保存代码();
当前界面.跳转界面(_临时文件);
},_操作框);

加入按钮("撤销",function(){
_代码框.撤销();
},_操作框);

加入按钮("重做",function(){
_代码框.重做();
},_操作框);

加入按钮("保存",function(){
保存代码();
弹窗.提示("保存完成 ~");
},_操作框);

加入按钮("VAR",function(){
_代码框.插入("var _");
},_操作框);

加入按钮("LET",function(){
_代码框.插入("let _");
},_操作框);

加入按钮("CONST",function(){
_代码框.插入("const _");
},_操作框);

加入按钮("FN",function(){
_代码框.插入("function() {\n}");
},_操作框)
.置长按事件(function() {
_代码框.插入("function(args) {\n}");
return false;
});

加入按钮("打印",function(){
_代码框.插入("弹窗.提示(\"\");");
},_操作框);

加入按钮("弹窗",function(){
_代码框.插入("弹窗.普通(当前界面,\n\"\",\n");
},_操作框);

加入按钮("全选",function(){
_代码框.全选();
},_所有选中).置布局权重(1);

加入按钮("复制",function(){
_代码框.复制();
},_所有选中).置布局权重(1);

加入按钮("剪切",function(){
_代码框.剪切();
},_所有选中).置布局权重(1);

加入按钮("粘贴",function(){
_代码框.全选();
},_所有选中).置布局权重(1);

var _所有符号 = [
"(",")",
"{","}",
",",".",
,"\"","=",
"[","]",";"
,"_","<"
,">","(当前界面)","当前环境","当前上下文"
]

for (k in _所有符号) {
线性布局(当前界面)
.置填充("6dp")
.置左填充("16dp")
.置右填充("16dp")
.置高度("36dp")
.置背景("透明")
.置重力("中间")
.加入子元素(文本控件(当前界面)
.置标签("符号")
.置文本颜色(颜色.白色)
.置文本(_所有符号[k]))
.加入到(_符号框)
.置单击事件(function(args) {
插入(args[0].取子元素("符号").取文本())
})
}

function 插入(_代码) {
_代码框.插入(_代码)
}

var _代码框 = 代码框(当前界面)
.加入到(_内容)
.置文本(字符.读取(_临时文件) || "")
.置代码选中事件(function(args) {
    if(args[0] == true) {
        _标题栏.隐藏();
        _工具栏.隐藏();
        _所有选中.显示();
    } else {
        _标题栏.显示();
        _工具栏.显示();
        _所有选中.隐藏();
    }
});

var _关于弹窗 = 弹窗.普通(当前界面,
"关于 乐园之土 "+应用.取版本名(),
字符.读取("@assets/about.txt"),
"联系作者",function() {
_关于弹窗.关闭();
网络.QQ.作者();
},
"加入讨论群",function() {
_关于弹窗.关闭();
网络.QQ.乐园部();
},
"关闭",function() {
_关于弹窗.关闭();
});

var _侧滑 = 线性布局(当前界面)
.置主题("底层")
.置背景(颜色.白色)
.到侧滑左布局();

_侧滑.加入到(_底层);

var _侧滑标题 = 标题栏(当前界面)
.置标题("内测版 "+应用.取版本名())
.左按钮("安卓",function(){
_关于弹窗.显示();
})
.加入到(_侧滑);

var _侧滑内容 = 线性布局(当前界面)
.置主题("底层")
.置高度("最大")
.置填充("16dp")
.加入到(_侧滑);

var _帮助 = 滚动视图(当前界面)
.置宽度("最大").置高度("最大")
.加入子元素(文本控件(当前界面)
.置文本(字符.读取("@assets/help.txt")))
.加入到(_侧滑内容);

当前界面.界面销毁事件 = 保存代码;

function 保存代码(){
字符.保存(_临时文件,_代码框.取文本());
}
