function 更新(_函数,...)
  local _参数 = {...};
  处理.主线程(function(args);
    _函数(table.unpack(_参数));
  end,{});
end

if #当前界面.传入数据 ~= 2 then
  _设置文件 = 当前界面.传入数据[0]
  _文件名 = 当前界面.传入数据[1]
  _工程目录 = 当前界面.传入数据[2]
  当前界面.不结束 = true;
  主体线程 = 线程(function()

    function 读取设置()
      _设置 = 设置.打开XML(_设置文件);
    end

    function 保存设置()
      设置.保存XML(_设置文件,_设置);
    end

    _布局 = 创建布局 {
      线性布局;
      主题 = "底层";
      {
        标题栏;
        赋值 = "_标题";
        标题 = "工程信息";
      };
      {
        滚动视图;
        宽度 = "最大";
        高度 = "最大";
        {
          线性布局;
          填充 = "16dp";
          主题 = "底层";
          赋值 = "_内容";
        }
      }
    }

    _标题.左按钮("返回",function()
      当前界面.结束();
    end)


    更新(_布局.打开,当前界面);

    读取设置();

    local 所有更新 = {
      function()
        读取设置();
      end
    };

    function 更新所有()
      for _k,_v in ipairs(所有更新) do
        if _v ~= nil and type(_v) == "function" then
          _v();
        end
      end
    end

    function 新设置(_键值,_默认)
      if _设置[_键值] == nil then
        _设置[_键值] = _默认;
        保存设置();
      end
      local _赋值 = "_".._键值
      local _布局 = 创建布局 {
        线性布局;
        宽度 = "最大";
        高度 = "56dp";
        背景 = "透明";
        重力 = "中间垂直";
        左填充 = "16dp";
        上填充 = "4dp";
        下填充 = "4dp";
        单击事件 = function()
          设置弹窗(_键值);
        end;
        {
          文本控件;
          文本 = _键值;
          赋值 = _赋值;
        }
      }
      table.insert(所有更新,function()
        pcall(function()
          _G[_赋值].文本 = _键值.." : ".._设置[_键值];
        end)
      end);
      _布局.加入到(_内容);
      return _布局;
    end

    function 设置弹窗(_键值)
      _设置弹窗 = 弹窗.普通(当前界面,
      "设置".._键值,
      创建布局 {
        线性布局;
        {
          编辑框;
          文本 = _设置[_键值];
          赋值 = "_编辑";
        }
      },
      "更改",function()
        if _编辑.文本 == "" then
          弹窗.提示 "设置请不要留空 ~";
        else
          _设置[_键值] = _编辑.文本;
          保存设置();
          _设置弹窗.隐藏();
          更新所有();
        end
      end,
      "取消",function()
        _设置弹窗.隐藏();
      end
      ).显示();
    end

    新设置("工程名","我的应用");
    新设置("包名","com.myapp.app");
    新设置("版本号","1");
    新设置("版本名","1.0");
    更新所有();

    function 新按钮(_文本,_方法)
      local _布局 = 创建布局 {
        线性布局;
        宽度 = "最大";
        高度 = "56dp";
        背景 = "透明";
        重力 = "中间垂直";
        左填充 = "16dp";
        上填充 = "4dp";
        下填充 = "4dp";
        单击事件 = _方法;
        {
          文本控件;
          文本 = _文本;
        }
      }
      _布局.加入到(_内容);
      return _布局;
    end

    新按钮("进入编辑器",function()
      当前界面.跳转界面("#edit.lua",{_设置文件,_文件名,_工程目录});
    end)

    新按钮("打包APK(未完成)",function()
    end)

    新按钮("权限编辑(未完成)",function()
    end)
  
  end,{}).启动();

else

  当前界面.结束();

end