package 放课后乐园部.视图.扩展;

import android.content.*;
import 放课后乐园部.视图.*;
import 放课后乐园部.收集.*;
import 放课后乐园部.事件.*;
import 放课后乐园部.基本.*;

public class 符号栏 extends 横向滚动 {

    public static 集合 符号 = 集合.到集合(new String[] {"(",")","[","]","{","}",";","\"","=",":",".",",","_","+","-","*","/","\\","%","#","^","$","?","<",">","~","'"});

    public 通用方法 符号单击事件;

    Context 上下文;
    public 线性布局 底层;

    public 符号栏(Context $上下文) {
        super($上下文);
        上下文 = $上下文;
        底层 = new 线性布局(上下文);
		底层.置方向("水平");
		底层.置背景(主题.基本色());
		底层.加入到(this);
    }

    通用方法 单击 = new 通用方法() {
        @Override
        public Object 调用(Object[] $参数) {
            调用方法.事件(符号单击事件, ((线性布局)$参数[0]).取子元素("文本"));
            return null;
        }
    };

    public void 更新() {
        for (String $单个 : 符号) {
			文本视图 $文本 = new 文本视图(上下文);
			$文本.置标签("文本");
			$文本.置文本颜色(颜色.白色);
			$文本.置文本($单个);
            线性布局 $符号 = new 线性布局(上下文);
			$符号.置宽度("自动");
			$符号.置高度("自动");
			$符号.置背景("透明");
			$符号.置重力("中间");
			$符号.置填充("6dp", "8dp", "16dp", "16dp");
			$符号.置单击事件(单击);
			$符号.加入子元素($文本);
			$符号.加入到(底层);
        }
    }

}
