package 放课后乐园部.安卓.资源.布局;

import android.content.*;
import 放课后乐园部.安卓.视图.*;
import 放课后乐园部.安卓.工具.*;

public class 布局_初始化 extends 布局_基本界面 {

    public 布局_初始化(Context $上下文) {

        super($上下文);

        标题.置标题(应用工具.取应用名() + " - 初始化");
        
        底层.置高度("自动");
        底层.置方向("水平");
        底层.置重力("中间垂直");
		底层.置填充("16dp");
		
        进度条 $进度 = new 进度圈(底层);
		$进度.置标签("进度");
        //$进度.置宽度("最大");
        $进度.置自动(true);
        //$进度.置填充("4dp");

        文本视图 $文本 = new 文本视图(底层);
		$文本.置标签("文本");
		$文本.置文本("正在初始化 ~ \n这可能需要几分钟的时间。");
		$文本.置左填充("16dp");

    }

}
